## Staging: network
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 8 to add, 2 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                             NAME                              |
|--------|---------------------------------------------------------------|
| add    | `module.wordpress_vpc.aws_eip.nat[1]`                         |
|        | `module.wordpress_vpc.aws_eip.nat[2]`                         |
|        | `module.wordpress_vpc.aws_nat_gateway.nat_gw[1]`              |
|        | `module.wordpress_vpc.aws_nat_gateway.nat_gw[2]`              |
|        | `module.wordpress_vpc.aws_route.private_nat_gateway[1]`       |
|        | `module.wordpress_vpc.aws_route.private_nat_gateway[2]`       |
|        | `module.wordpress_vpc.aws_route_table.private[1]`             |
|        | `module.wordpress_vpc.aws_route_table.private[2]`             |
| update | `module.wordpress_vpc.aws_route_table_association.private[1]` |
|        | `module.wordpress_vpc.aws_route_table_association.private[2]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.wordpress_vpc.aws_eip.nat[1] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "CostCentre" = "PlatformGCArticles"
          + "Name"       = "wordpress-eip1"
          + "Terraform"  = "true"
        }
      + tags_all             = {
          + "CostCentre" = "PlatformGCArticles"
          + "Name"       = "wordpress-eip1"
          + "Terraform"  = "true"
        }
      + vpc                  = (known after apply)
    }

  # module.wordpress_vpc.aws_eip.nat[2] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "CostCentre" = "PlatformGCArticles"
          + "Name"       = "wordpress-eip2"
          + "Terraform"  = "true"
        }
      + tags_all             = {
          + "CostCentre" = "PlatformGCArticles"
          + "Name"       = "wordpress-eip2"
          + "Terraform"  = "true"
        }
      + vpc                  = (known after apply)
    }

  # module.wordpress_vpc.aws_nat_gateway.nat_gw[1] will be created
  + resource "aws_nat_gateway" "nat_gw" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = "subnet-0915f93428546342d"
      + tags                               = {
          + "CostCentre" = "PlatformGCArticles"
          + "Name"       = "wordpress-natgw-1"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre" = "PlatformGCArticles"
          + "Name"       = "wordpress-natgw-1"
          + "Terraform"  = "true"
        }
    }

  # module.wordpress_vpc.aws_nat_gateway.nat_gw[2] will be created
  + resource "aws_nat_gateway" "nat_gw" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = "subnet-0f8fa6af578d92096"
      + tags                               = {
          + "CostCentre" = "PlatformGCArticles"
          + "Name"       = "wordpress-natgw-2"
          + "Terraform"  = "true"
        }
      + tags_all                           = {
          + "CostCentre" = "PlatformGCArticles"
          + "Name"       = "wordpress-natgw-2"
          + "Terraform"  = "true"
        }
    }

  # module.wordpress_vpc.aws_route.private_nat_gateway[1] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.wordpress_vpc.aws_route.private_nat_gateway[2] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.wordpress_vpc.aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "CostCentre" = "PlatformGCArticles"
          + "Name"       = "wordpress_private_route_table_1"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "PlatformGCArticles"
          + "Name"       = "wordpress_private_route_table_1"
          + "Terraform"  = "true"
        }
      + vpc_id           = "vpc-0a2a6b74a05f77fd1"
    }

  # module.wordpress_vpc.aws_route_table.private[2] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "CostCentre" = "PlatformGCArticles"
          + "Name"       = "wordpress_private_route_table_2"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "PlatformGCArticles"
          + "Name"       = "wordpress_private_route_table_2"
          + "Terraform"  = "true"
        }
      + vpc_id           = "vpc-0a2a6b74a05f77fd1"
    }

  # module.wordpress_vpc.aws_route_table_association.private[1] will be updated in-place
  ~ resource "aws_route_table_association" "private" {
        id             = "rtbassoc-0eef9cd53ca361312"
      ~ route_table_id = "rtb-0d8036177d16501e4" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.wordpress_vpc.aws_route_table_association.private[2] will be updated in-place
  ~ resource "aws_route_table_association" "private" {
        id             = "rtbassoc-046cc83884c71bb1f"
      ~ route_table_id = "rtb-0d8036177d16501e4" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 8 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.ecs_events_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.vpc_endpoint"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.wordpress_ecs"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.wordpress_load_balancer"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.ecr-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.ecr-dkr"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.monitoring"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.s3"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.secretsmanager"]
WARN - plan.json - main - Missing Common Tags: ["aws_vpc_endpoint.sns"]

30 tests, 19 passed, 11 warnings, 0 failures, 0 exceptions

```

</details>
